$.extend($.dateDropperSetup.languages, {
	'he': {
		name: 'Hebrew',
		months: {
			short: [
				'ינואר',
				'פברואר',
				'מרץ',
				'אפריל',
				'מאי',
				'יוני',
				'יולי',
				'אוגוסט',
				'ספטמבר',
				'אוקטובר',
				'נובמבר',
				'דצמבר'
			],
			full: [
				'ינואר',
				'פברואר',
				'מרץ',
				'אפריל',
				'מאי',
				'יוני',
				'יולי',
				'אוגוסט',
				'ספטמבר',
				'אוקטובר',
				'נובמבר',
				'דצמבר'
			]
		},
		weekdays: {
			short: [
				'א',
				'ב',
				'ג',
				'ד',
				'ה',
				'ו',
				'ש'
			],
			full: [
				'ראשון',
				'שני',
				'שלישי',
				'רביעי',
				'חמישי',
				'שישי',
				'שבת'
			]
		}
	}
});